<?xml version="1.0" ?>
<net name="head-pose-estimation-adas-0001" version="11">
	<layers>
		<layer id="33" name="data" type="Parameter" version="opset1">
			<data shape="1,3,60,60" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="angle_p_fc/flatten_fc_input/value2853397" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="9599633334" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="9609643211" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="9619653322" type="Const" version="opset1">
			<data offset="16" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="9629663403" type="Const" version="opset1">
			<data offset="20" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="5555593175" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="5565603196" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="5575613250" type="Const" version="opset1">
			<data offset="24" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="5585623274" type="Const" version="opset1">
			<data offset="28" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="5755793364" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="5765803343" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="5775813310" type="Const" version="opset1">
			<data offset="32" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="5785823253" type="Const" version="opset1">
			<data offset="36" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="99910033412" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="100010043283" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="100110053292" type="Const" version="opset1">
			<data offset="40" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="100210063430" type="Const" version="opset1">
			<data offset="44" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="6556593169" type="Const" version="opset1">
			<data offset="48" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="6566603232" type="Const" version="opset1">
			<data offset="52" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="6576613154" type="Const" version="opset1">
			<data offset="48" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="6586623157" type="Const" version="opset1">
			<data offset="52" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="6356393247" type="Const" version="opset1">
			<data offset="56" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="6366403241" type="Const" version="opset1">
			<data offset="60" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="6376413202" type="Const" version="opset1">
			<data offset="56" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="6386423379" type="Const" version="opset1">
			<data offset="60" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="5055093331" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="5065103145" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="5075113319" type="Const" version="opset1">
			<data offset="64" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="5085123409" type="Const" version="opset1">
			<data offset="68" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="5255293223" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="5265303382" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="5275313187" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="5285323415" type="Const" version="opset1">
			<data offset="76" size="4" shape="" element_type="f32"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="Constant_2301583220" type="Const" version="opset1">
			<data offset="80" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_2301582084/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Subtract_231" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="bn/data/mean/Fused_Mul_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_12971613376" type="Const" version="opset1">
			<data offset="86" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_12971612085/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bn/data/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_21781643226" type="Const" version="opset1">
			<data offset="92" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="data_add_21781642086/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="bn/data/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv1/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv1/WithoutBiases/fq_weights_1/scale25313286" type="Const" version="opset1">
			<data offset="98" size="128" shape="32,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="611672087/restored_convert/quantized25233394" type="Const" version="opset1">
			<data offset="226" size="864" shape="32,3,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="611672087/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv1/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv1/Dims12581703391" type="Const" version="opset1">
			<data offset="1090" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv1/Dims12581702088/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="relu_conv1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_mul_218021841743385" type="Const" version="opset1">
			<data offset="1154" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_mul_218021841742089/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="bn1/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="data_add_218121861773229" type="Const" version="opset1">
			<data offset="1218" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_218121861772090/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bn1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="bn1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="pool1/WithoutBiases/fq_weights_1633" type="Const" version="opset1">
			<data offset="1282" size="9216" shape="16,32,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="pool1/WithoutBiases/fq_weights_1633/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="pool1/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="pool1/Dims12641833370" type="Const" version="opset1">
			<data offset="10498" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="pool1/Dims12641832092/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="pool1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pool1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv2/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv2/WithoutBiases/fq_weights_1/scale23513340" type="Const" version="opset1">
			<data offset="10530" size="256" shape="64,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="811862093/restored_convert/quantized23433418" type="Const" version="opset1">
			<data offset="10786" size="9216" shape="64,16,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="811862093/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv2/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv2/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv2/Dims12941893436" type="Const" version="opset1">
			<data offset="20002" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv2/Dims12941892094/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="relu_conv2" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_mul_218821921933358" type="Const" version="opset1">
			<data offset="20130" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_mul_218821921932095/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bn2/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_218921941963163" type="Const" version="opset1">
			<data offset="20258" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_218921941962096/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="bn2/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="bn2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="pool2" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="3,3" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv3/WithoutBiases/fq_weights_1793" type="Const" version="opset1">
			<data offset="20386" size="147456" shape="128,64,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv3/WithoutBiases/fq_weights_1793/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv3/Dims12462033166" type="Const" version="opset1">
			<data offset="167842" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv3/Dims12462032098/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="relu_conv3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_mul_219622002073262" type="Const" version="opset1">
			<data offset="168098" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_mul_219622002072099/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bn3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_219722022103367" type="Const" version="opset1">
			<data offset="168354" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="data_add_219722022102100/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="bn3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="bn3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="pool3/WithoutBiases/fq_weights_1693" type="Const" version="opset1">
			<data offset="168610" size="147456" shape="64,128,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="pool3/WithoutBiases/fq_weights_1693/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="pool3/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="pool3/Dims13002163433" type="Const" version="opset1">
			<data offset="316066" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="pool3/Dims13002162102/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="pool3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pool3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv4/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv4/WithoutBiases/fq_weights_1/scale24113325" type="Const" version="opset1">
			<data offset="316194" size="512" shape="128,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="512192103/restored_convert/quantized24033217" type="Const" version="opset1">
			<data offset="316706" size="73728" shape="128,64,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="512192103/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv4/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv4/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv4/Dims12882223355" type="Const" version="opset1">
			<data offset="390434" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv4/Dims12882222104/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="conv4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="relu_conv4" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="data_mul_220422082263400" type="Const" version="opset1">
			<data offset="390690" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="data_mul_220422082262105/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bn4/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="data_add_220522102293256" type="Const" version="opset1">
			<data offset="390946" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="data_add_220522102292106/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="bn4/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="bn4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="pool4/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="pool4" type="MaxPool" version="opset8">
			<data strides="2,2" kernel="3,3" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" auto_pad="explicit" dilations="1,1" axis="0" index_element_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="120" name="conv5/WithoutBiases/fq_weights_1/scale26213427" type="Const" version="opset1">
			<data offset="391202" size="1024" shape="256,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="1112332107/restored_convert/quantized26133184" type="Const" version="opset1">
			<data offset="392226" size="294912" shape="256,128,3,3" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="1112332107/restored_convert/quantized/to_f32" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="conv5/WithoutBiases/fq_weights_1/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="conv5/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="conv5/Dims12822363199" type="Const" version="opset1">
			<data offset="687138" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="conv5/Dims12822362108/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="conv5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="relu_conv5" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="data_mul_221222162403298" type="Const" version="opset1">
			<data offset="687650" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="data_mul_221222162402109/restored_convert" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
